astb_relise/src/InformationRegisters/ЗначенияАнтропометрическихСвойств/ЗначенияАнтропометрическихСвойств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияАнтропометрическихСвойств</name>
  <resources>
    <name>ЗначениеСвойства</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвойства</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ДопустимыеЗначенияАнтропометрическихСвойств/ДопустимыеЗначенияАнтропометрическихСвойств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДопустимыеЗначенияАнтропометрическихСвойств</name>
  <dimensions>
    <name>ВидСвойства</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопустимоеЗначение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ЗначенияАнтропометрическихСвойств/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Функция ПолучитьМассивДопустимыхЗначений(ВидСвойства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДопустимыеЗначенияАнтропометрическихСвойств.ДопустимоеЗначение
	|ИЗ
	|	РегистрСведений.ДопустимыеЗначенияАнтропометрическихСвойств КАК ДопустимыеЗначенияАнтропометрическихСвойств
	|ГДЕ
	|	ДопустимыеЗначенияАнтропометрическихСвойств.ВидСвойства = &ВидСвойства";
	
	Запрос.УстановитьПараметр("ВидСвойства",ВидСвойства);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДопустимоеЗначение");
	
КонецФункции

&НаКлиенте
Процедура ВидСвойстваПриИзменении(Элемент)
	                                                                                  
	ЭтаФорма.Элементы.ЗначениеСвойства.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДопустимыхЗначений(Запись.ВидСвойства));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Элементы.ЗначениеСвойства.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДопустимыхЗначений(Запись.ВидСвойства));
	
КонецПроцедуры
